---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.JoinElementsFailures.CannotJoinDesignOptions
source: html/8f0e7335-c831-7bf8-f87c-01166ac8a93c.htm
---
# Autodesk.Revit.DB.BuiltInFailures.JoinElementsFailures.CannotJoinDesignOptions Property

An element cannot join to an element in a secondary Design Option unless it is in the same secondary Design Option.

## Syntax (C#)
```csharp
public static FailureDefinitionId CannotJoinDesignOptions { get; }
```